In [1]:
import pandas as pd
import scipy

In [2]:
data=pd.read_csv('Advertising.csv')

In [3]:
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [4]:
del data['Unnamed: 0']

In [5]:
data.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

Data shows different amounts spent by a company for advertising through TV, Radio, Newspaper and corresponding sales

In [9]:
data.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [ ]:
Doing one way anova test to compare amount spent for different types of advertising

In [6]:
from scipy import stats

In [10]:
f,p=scipy.stats.f_oneway(data['TV'],data['Radio'],data['Newspaper'])

H0:Same amount was spent for all ads
H1:Different amount was spent for all ads
alpha=0.05

In [11]:
Result=print('F value is',f, 'P value is',p)

F value is 358.8514595342597 P value is 4.552931539744962e-103

Since p value<0.05 ,we reject the null hypothesis and conclude that different amount was spent for all ads